CK-AT/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp

/* Todo*/
// https://github.com/espressif/arduino-esp32/issues/7779

#define ESTIMATE_LOADCELL_VARIANCE
#define ISV_COMMUNICATION
// #define PRINT_SERVO_STATES

#define DEBUG_INFO_0_CYCLE_TIMER 1
#define DEBUG_INFO_0_STEPPER_POS 2
#define DEBUG_INFO_0_LOADCELL_READING 4
#define DEBUG_INFO_0_SERVO_READINGS 8
#define DEBUG_INFO_0_PRINT_ALL_SERVO_REGISTERS 16
#define DEBUG_INFO_0_STATE_BASIC_INFO_STRUCT 32
#define DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT 64
#define DEBUG_INFO_0_CONTROL_LOOP_ALGO 128

#define PI 3.14159267
#define DEG_TO_RAD PI / 180

#include "Main.h"

#include "Arduino.h"
#include "FanatecInterface.h"
#include "OTA_Pull.h"
#include "Version_Board.h"
#include "esp_system.h"
#include "soc/rtc_cntl_reg.h"

// #define ALLOW_SYSTEM_IDENTIFICATION

/**********************************************************************************************/
/*                                                                                            */
/*                         function declarations                                              */
/*                                                                                            */
/**********************************************************************************************/

// void serialCommunicationTask( void * pvParameters );

// void OTATask( void * pvParameters );

// void ESPNOW_SyncTask( void * pvParameters);
//  https://www.tutorialspoint.com/cyclic-redundancy-check-crc-in-arduino
uint16_t checksumCalculator(uint8_t *data, uint16_t length) {
    uint16_t curr_crc = 0x0000;
    uint8_t sum1 = (uint8_t)curr_crc;
    uint8_t sum2 = (uint8_t)(curr_crc >> 8);
    int index;
    for (index = 0; index < length; index = index + 1) {
        sum1 = (sum1 + data[index]) % 255;
        sum2 = (sum2 + sum1) % 255;
    }
    return (sum2 << 8) | sum1;
}

#include <EEPROM.h>

#include "DiyActivePedal_types.h"
DAP_config_st dap_config_st;
DAP_calculationVariables_st dap_calculationVariables_st;
DAP_state_basic_st dap_state_basic_st;
DAP_state_extended_st dap_state_extended_st;
DAP_actions_st dap_actions_st;
DAP_bridge_state_st dap_bridge_state_st;
DAP_config_st dap_config_st_Clu;
DAP_config_st dap_config_st_Brk;
DAP_config_st dap_config_st_Gas;
DAP_config_st dap_config_st_Temp;
DAP_ESPPairing_st dap_esppairing_st;   // saving
DAP_ESPPairing_st dap_esppairing_lcl;  // sending
// DAP_config_st dap_config_st_store[3];
DAP_bridge_state_st dap_bridge_state_lcl;  //
#include <EEPROM.h>

#include "CycleTimer.h"
#include "SPI.h"
#include "Wire.h"
#define EEPROM_offset 15
/**********************************************************************************************/
/*                                                                                            */
/*                         iterpolation  definitions                                          */
/*                                                                                            */
/**********************************************************************************************/

/**********************************************************************************************/
/*                                                                                            */
/*                         multitasking  definitions                                          */
/*                                                                                            */
/**********************************************************************************************/
#ifndef CONFIG_IDF_TARGET_ESP32S3
    #include "soc/rtc_wdt.h"
#endif
#ifdef USING_LED
    #include <Adafruit_NeoPixel.h>

    #include "soc/soc_caps.h"
    #ifdef LED_ENABLE_WAVESHARE
        #define LEDS_COUNT 1
Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO, NEO_RGB + NEO_KHZ800);
    #endif
    #ifdef LED_ENABLE_DONGLE
        #define LEDS_COUNT 3
Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO, NEO_GRB + NEO_KHZ800);
    #endif
    #define CHANNEL 0
    #define LED_BRIGHT 30
/*
static const crgb_t L_RED = 0xff0000;
static const crgb_t L_GREEN = 0x00ff00;
static const crgb_t L_BLUE = 0x0000ff;
static const crgb_t L_WHITE = 0xe0e0e0;
static const crgb_t L_YELLOW = 0xffde21;
static const crgb_t L_ORANGE = 0xffa500;
static const crgb_t L_CYAN = 0x00ffff;
static const crgb_t L_PURPLE = 0x800080;
*/

#endif

// #define PRINT_USED_STACK_SIZE
//  https://stackoverflow.com/questions/55998078/freertos-task-priority-and-stack-size
#define STACK_SIZE_FOR_TASK_1 0.2 * (configTOTAL_HEAP_SIZE / 4)
#define STACK_SIZE_FOR_TASK_2 0.2 * (configTOTAL_HEAP_SIZE / 4)

TaskHandle_t Task1;
TaskHandle_t Task2;
TaskHandle_t Task3;
TaskHandle_t Task4;
TaskHandle_t Task5;

// static SemaphoreHandle_t semaphore_updateConfig=NULL;
bool configUpdateAvailable = false;  // semaphore protected data
DAP_config_st dap_config_st_local;

// static SemaphoreHandle_t semaphore_updateJoystick=NULL;
int32_t joystickNormalizedToInt32 = 0;  // semaphore protected data

// static SemaphoreHandle_t semaphore_resetServoPos=NULL;
bool resetPedalPosition = false;

// static SemaphoreHandle_t semaphore_readServoValues=NULL;

// static SemaphoreHandle_t semaphore_updatePedalStates=NULL;

/**********************************************************************************************/
/*                                                                                            */
/*                         controller  definitions                                            */
/*                                                                                            */
/**********************************************************************************************/

#include "Controller.h"
#include "LogOutput.h"
#include "RTDebugOutput.h"

/**********************************************************************************************/
/*                                                                                            */
/*                         pedal mechanics definitions                                        */
/*                                                                                            */
/**********************************************************************************************/

#include "PedalGeometry.h"

/**********************************************************************************************/
/*                                                                                            */
/*                         OTA                                                                */
/*                                                                                            */
/**********************************************************************************************/
// OTA update
#ifdef OTA_update
    #include "ota.h"
TaskHandle_t Task4;
#endif

#ifdef HAS_CAN
    #include <CANManager.h>
GatewayCANManager can_manager;
#endif

#include <AxesManager.h>
AxesManager axes_manager = AxesManager(can_manager);

#ifdef RGB_LED
    #include <NeoPixelBus.h>
NeoPixelBus<NeoGrbFeature, NeoWs2812xMethod> pixels(NUM_LEDS, RGB_LED);
const RgbColor yellow = RgbColor(46, 34, 0);
const RgbColor green = RgbColor(0, 46, 0);
const RgbColor red = RgbColor(46, 0, 0);
const RgbColor purple = RgbColor(36, 0, 46);
#endif

#ifdef Using_MCP4728
    #include <Adafruit_MCP4728.h>
Adafruit_MCP4728 mcp;
TwoWire MCP4728_I2C = TwoWire(1);
bool MCP_status = false;
#endif

// ESPNOW
#ifdef ESPNOW_Enable
    #include "ESPNOW_lib.h"
TaskHandle_t Task6;
#endif

