CK-AT/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
bool dap_action_update = false;
#include "MovingAverageFilter.h"
MovingAverageFilter rssi_filter(30);
int32_t joystickNormalizedToInt32_local = 0;
unsigned long pedal_last_update_basic[3] = {1, 1, 1};
unsigned long pedal_last_update_ext[3] = {1, 1, 1};
uint8_t pedal_avaliable[3] = {0, 0, 0};
uint8_t LED_Status = 0;  // 0=normal 1= pairing
void ESPNOW_SyncTask(void *pvParameters);
void Joystick_Task(void *pvParameters);
void LED_Task(void *pvParameters);
void Serial_Task(void *pvParameters);
void LED_Task_Dongle(void *pvParameters);
void FanatecUpdate(void *pvParameters);
LogOutputService logOutput = LogOutputService();
RTDebugOutputService debugOutput = RTDebugOutputService();

#ifdef Fanatec_comunication
FanatecInterface fanatec(Fanatec_serial_RX, Fanatec_serial_TX, Fanatec_plug);  // RX: GPIO18, TX: GPIO17, PLUG: GPIO16
bool Fanatec_Mode = false;
#endif

#ifdef OTA_Update
void OTATask(void *pvParameters);
TaskHandle_t Task7;
#endif

enum CommChannel {
    USB_SERIAL,
    ISOTP,
    ESP_NOW
};

void on_action_received(uint8_t axis_id, const DAP_actions_st *action, CommChannel comm_channel);
void on_config_received(uint8_t axis_id, const DAP_config_st *config, CommChannel comm_channel);
void on_mech_config_received(uint8_t axis_id, const DAP_mech_config_st *config, CommChannel comm_channel);
void on_bridge_state_received(const DAP_bridge_state_st *bridge_state, CommChannel comm_channel);

bool on_data_reception(const uint8_t *data, uint32_t len, CommChannel comm_channel) {
    uint8_t axis_id = reinterpret_cast<const payloadHeader *>(data)->PedalTag;
    switch (verify_ffb_data_struct(data, len)) {
        case FFBDataType::CONFIG:
            on_config_received(axis_id, reinterpret_cast<const DAP_config_st *>(data), comm_channel);
            break;
        case FFBDataType::MECH_CONFIG:
            on_mech_config_received(axis_id, reinterpret_cast<const DAP_mech_config_st *>(data), comm_channel);
            break;
        case FFBDataType::ACTION:
            on_action_received(axis_id, reinterpret_cast<const DAP_actions_st *>(data), comm_channel);
            break;
        case FFBDataType::BRIDGE_STATE:
            on_bridge_state_received(reinterpret_cast<const DAP_bridge_state_st *>(data), comm_channel);
            break;
        default:
            return false;
            break;
    }
    return true;
}

void on_bridge_state_received(const DAP_bridge_state_st *bridge_state, CommChannel comm_channel) {
    if (bridge_state->payloadBridgeState_.Bridge_action == 1) {
#ifdef ESPNow_Pairing_function
        Serial.println("[L]Bridge Pairing...");
        software_pairing_action_b = true;
#else
        Serial.println("[L]Pairing command not supported");
#endif
    }
    // action=2, restart
    if (bridge_state->payloadBridgeState_.Bridge_action == 2) {
        Serial.println("[L]Bridge Restart");
        delay(1000);
        ESP.restart();
    }
    if (bridge_state->payloadBridgeState_.Bridge_action == 3) {
// aciton=3 restart into boot mode
#ifdef Using_Board_ESP32S3
        Serial.println("[L]Bridge Restart into Download mode");
        delay(1000);
        REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
        ESP.restart();
#else
        Serial.println("[L]Command not supported ");
        delay(1000);
#endif
    }
}

void on_config_received(uint8_t axis_id, const DAP_config_st *config, CommChannel comm_channel) {
    axes_manager.on_config_update(axis_id, config);
    if (comm_channel == CommChannel::USB_SERIAL) {
        can_manager.send_payload_to_axis(axis_id, reinterpret_cast<const uint8_t *>(config), sizeof(DAP_config_st));
    } else {
        Serial.printf("[L]Axis %d (%s): config returned\r\n", axis_id, axis_names[axis_id]);
        Serial.write(reinterpret_cast<const uint8_t *>(config), sizeof(DAP_config_st));
        Serial.print("\r\n");
    }
}

void on_mech_config_received(uint8_t axis_id, const DAP_mech_config_st *config, CommChannel comm_channel) {
    if (comm_channel == CommChannel::USB_SERIAL) {
        can_manager.send_payload_to_axis(axis_id, reinterpret_cast<const uint8_t *>(config), sizeof(DAP_mech_config_st));
    } else {
        Serial.printf("[L]Axis %d (%s): mech config returned\r\n", axis_id, axis_names[axis_id]);
        Serial.write(reinterpret_cast<const uint8_t *>(config), sizeof(DAP_mech_config_st));
        Serial.print("\r\n");
    }
}

void on_action_received(uint8_t axis_id, const DAP_actions_st *action, CommChannel comm_channel) {
    if (comm_channel == CommChannel::USB_SERIAL) {
        if (action->payloadPedalAction_.triggerAbs_u8) {
            can_manager.send_abs_trigger_to_axis(axis_id);
        } else {
            can_manager.send_payload_to_axis(axis_id, reinterpret_cast<const uint8_t *>(action), sizeof(DAP_actions_st));
        }
        if (action->payloadPedalAction_.Rudder_action && (axis_id == 2)) {
            if (pedal_status == 0) {
                Serial.printf("[L]Pedal mode on\r\n");
                pedal_status = 1;
            } else {
                Serial.printf("[L]Pedal mode off\r\n");
                pedal_status = 0;
            }
        }
    }
}

void on_axis_payload(uint8_t axis_id, uint8_t *data, uint32_t len) {
    on_data_reception(data, len, CommChannel::ISOTP);
}

/**********************************************************************************************/
/*                                                                                            */
/*                         setup function                                                     */
/*                                                                                            */
/**********************************************************************************************/

void setup() {
    // Serial.begin(115200);
    // Serial.begin(921600);
    // Serial.begin(512000);
    //

#ifdef RGB_LED
    pixels.Begin();
    pixels.SetPixelColor(0, purple);
    pixels.Show();
#endif

#ifdef HAS_CAN
    can_manager.setup(1000, CAN_TX, CAN_RX, on_axis_payload);
#endif

#ifdef USB_JOYSTICK
    SetupController();
    delay(100);
#endif

#if PCB_VERSION == 5 || PCB_VERSION == 6 || PCB_VERSION == 7 || PCB_VERSION == 8
    // Serial.setTxTimeoutMs(0);
    Serial.setRxBufferSize(1024);
    Serial.setTimeout(5);
    Serial.begin(3000000);

