CK-AT/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
    // Serial0.begin(921600);
    // Serial0.setDebugOutput(false);
    // esp_log_level_set("*",ESP_LOG_INFO);
#else
    Serial.setRxBufferSize(1024);
    Serial.begin(921600);
    Serial.setTimeout(5);

#endif
    Serial.println(" ");
    Serial.println(" ");
    Serial.println(" ");

    Serial.println("[L]This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.");
    Serial.println("[L]Please check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal");
#ifdef OTA_Update
    Serial.print("[L]Board:");
    Serial.println(BRIDGE_BOARD);
    Serial.print("[L]Version:");
    Serial.println(BRIDGE_FIRMWARE_VERSION);
#endif

    // setup multi tasking
    /*
    semaphore_updateJoystick = xSemaphoreCreateMutex();
    semaphore_updateConfig = xSemaphoreCreateMutex();
    semaphore_resetServoPos = xSemaphoreCreateMutex();
    semaphore_updatePedalStates = xSemaphoreCreateMutex();
    */
    delay(10);
#ifdef ESPNow_Pairing_function
    // button read setup
    pinMode(Pairing_GPIO, INPUT_PULLUP);
    EEPROM.begin(256);
#endif
    /*
      if(semaphore_updateJoystick==NULL)
      {
        Serial.println("Could not create semaphore");
        ESP.restart();
      }
      if(semaphore_updateConfig==NULL)
      {
        Serial.println("Could not create semaphore");
        ESP.restart();
      }
      */

    // disableCore0WDT();
    enableCore1WDT();
    // enable ESP-NOW
    //  ESPNow_initialize();
    //  //ESPNow multi-tasking
    //  xTaskCreatePinnedToCore(
    //                        ESPNOW_SyncTask,
    //                        "ESPNOW_update_Task",
    //                        10000,
    //                        //STACK_SIZE_FOR_TASK_2,
    //                        NULL,
    //                        1,
    //                        &Task1,
    //                        0);
    //  delay(500);
    // Serial multitasking
    xTaskCreatePinnedToCore(Serial_Task, "Serial_update_Task", 5000,
                            // STACK_SIZE_FOR_TASK_2,
                            NULL, 1, &Task4, 1);
    delay(500);

#if defined(USB_JOYSTICK) && ARDUINO_USB_CDC_ON_BOOT == 0
    xTaskCreatePinnedToCore(Joystick_Task, "Joystick_update_Task", 10000,
                            // STACK_SIZE_FOR_TASK_2,
                            NULL, 1, &Task2, 0);
    delay(500);
#endif

#ifdef Using_MCP4728
    MCP4728_I2C.begin(MCP_SDA, MCP_SCL, 400000);
    uint8_t i2c_address[8] = {0x60, 0x61, 0x62, 0x63, 0x64, 0x65, 0x66, 0x67};
    int index_address = 0;
    int found_address = 0;
    int error;
    for (index_address = 0; index_address < 8; index_address++) {
        MCP4728_I2C.beginTransmission(i2c_address[index_address]);
        error = MCP4728_I2C.endTransmission();
        if (error == 0) {
            LogOutput::printf("I2C device found at address %i !\n", i2c_address[index_address]);
            found_address = index_address;
            break;

        } else {
            LogOutput::printf("try address %i", i2c_address[index_address]);
        }
    }

    if (mcp.begin(i2c_address[found_address], &MCP4728_I2C) == false) {
        LogOutput::printf("Couldn't find MCP4728, will not have analog output\n");
        MCP_status = false;
    } else {
        LogOutput::printf("MCP4728 found\n");
        MCP_status = true;
        // MCP.begin();
    }

#endif

    // initialize time_record
    uint8_t pedalIDX;
    for (pedalIDX = 0; pedalIDX < 3; pedalIDX++) {
        pedal_last_update_basic[pedalIDX] = millis();
        pedal_last_update_ext[pedalIDX] = millis();
    }
#ifdef LED_ENABLE_WAVESHARE
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0, 0xff, 0xff, 0xff);
    pixels.show();
    xTaskCreatePinnedToCore(LED_Task, "LED_update_Task", 3000,
                            // STACK_SIZE_FOR_TASK_2,
                            NULL, 1, &Task3, 0);
    delay(500);
#endif
#ifdef LED_ENABLE_DONGLE
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0, 0xff, 0xff, 0xff);
    pixels.show();
    xTaskCreatePinnedToCore(LED_Task_Dongle, "LED_update_Task", 3000,
                            // STACK_SIZE_FOR_TASK_2,
                            NULL, 1, &Task3, 0);
    delay(500);
#endif
#ifdef Fanatec_comunication
    // Initialize FanatecInterface
    fanatec.begin();

    // Set connection callback
    fanatec.onConnected([](bool connected) {
        if (connected) {
            LogOutput::printf("[L] FANATEC Connected to Wheelbase.\n");
        } else {
            LogOutput::printf("[L] FANATEC Disconnected from Wheelbase.\n");
        }
    });
    delay(2000);
    xTaskCreatePinnedToCore(FanatecUpdate, "Fanatec_update_Task", 3000,
                            // STACK_SIZE_FOR_TASK_5,
                            NULL, 1, &Task5, 1);
    delay(500);
#endif

#ifdef OTA_Update
    xTaskCreatePinnedToCore(OTATask, "OTA_update_Task", 16000,
                            // STACK_SIZE_FOR_TASK_5,
                            NULL, 1, &Task7, 1);
    delay(500);
#endif
    LogOutput::printf("[L]Setup end\n");
    // initialize wifi
    for (uint i = 0; i < 30; i++) {
        _basic_wifi_info.WIFI_PASS[i] = 0;
        _basic_wifi_info.WIFI_SSID[i] = 0;
    }

#ifdef RGB_LED
    pixels.SetPixelColor(0, green);
    pixels.Show();
#endif
}

/**********************************************************************************************/
/*                                                                                            */
/*                         Main function                                                      */
/*                                                                                            */
/**********************************************************************************************/
uint32_t loop_count = 0;
bool basic_rssi_update = false;
unsigned long bridge_state_last_update = millis();
unsigned long Pairing_state_start;
unsigned long Pairing_state_last_sending;
uint8_t press_count = 0;
uint Pairing_timeout = 20000;
bool Pairing_timeout_status = false;
bool building_dap_esppairing_lcl = false;
void loop() {
    delay(10);
}

void ESPNOW_SyncTask(void *pvParameters) {
    for (;;) {
#ifdef ESPNow_Pairing_function
        if (digitalRead(Pairing_GPIO) == LOW || software_pairing_action_b) {
            LogOutput::printf("[L]Bridge Pairing.....\n");
            delay(1000);
            Pairing_state_start = millis();
            Pairing_state_last_sending = millis();
            ESPNow_pairing_action_b = true;
            building_dap_esppairing_lcl = true;
            LED_Status = 1;
            software_pairing_action_b = false;
        }
        if (ESPNow_pairing_action_b) {
            unsigned long now = millis();
            // sending package
            if (building_dap_esppairing_lcl) {
                uint16_t crc = 0;
                building_dap_esppairing_lcl = false;
                dap_esppairing_lcl.payloadESPNowInfo_._deviceID = deviceID;
                dap_esppairing_lcl.payLoadHeader_.payloadType = DAP_PAYLOAD_TYPE_ESPNOW_PAIRING;
                dap_esppairing_lcl.payLoadHeader_.PedalTag = deviceID;
                dap_esppairing_lcl.payLoadHeader_.version = DAP_VERSION_CONFIG;
                crc = checksumCalculator((uint8_t *)(&(dap_esppairing_lcl.payLoadHeader_)),
                                         sizeof(dap_esppairing_lcl.payLoadHeader_) + sizeof(dap_esppairing_lcl.payloadESPNowInfo_));
                dap_esppairing_lcl.payloadFooter_.checkSum = crc;
            }
            if (now - Pairing_state_last_sending > 400) {
                Pairing_state_last_sending = now;
                ESPNow.send_message(broadcast_mac, (uint8_t *)&dap_esppairing_lcl, sizeof(dap_esppairing_lcl));
            }

