CK-AT/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
            // timeout check
            if (now - Pairing_state_start > Pairing_timeout) {
                LogOutput::printf("[L]Bridge Pairing timeout!\n");
                ESPNow_pairing_action_b = false;
                LED_Status = 0;
                if (UpdatePairingToEeprom) {
                    EEPROM.put(EEPROM_offset, _ESP_pairing_reg);
                    EEPROM.commit();
                    UpdatePairingToEeprom = false;

                    // list eeprom
                    ESP_pairing_reg ESP_pairing_reg_local;
                    EEPROM.get(EEPROM_offset, ESP_pairing_reg_local);
                    for (int i = 0; i < 4; i++) {
                        if (ESP_pairing_reg_local.Pair_status[i] == 1) {
                            LogOutput::printf("[L]#%iPair: %i Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", i, ESP_pairing_reg_local.Pair_status[i],
                                              ESP_pairing_reg_local.Pair_mac[i][0], ESP_pairing_reg_local.Pair_mac[i][1],
                                              ESP_pairing_reg_local.Pair_mac[i][2], ESP_pairing_reg_local.Pair_mac[i][3],
                                              ESP_pairing_reg_local.Pair_mac[i][4], ESP_pairing_reg_local.Pair_mac[i][5]);
                        }
                        LogOutput::printf("\n");
                    }
                    LogOutput::printf("\n");
                    // adding peer
                    /*
                    for(int i=0; i<4;i++)
                    {
                      if(_ESP_pairing_reg.Pair_status[i]==1)
                      {
                        if(i==0)
                        {
                          ESPNow.remove_peer(Clu_mac);
                          memcpy(&Clu_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                          delay(300);
                          ESPNow.add_peer(Clu_mac);

                        }
                        if(i==1)
                        {
                          ESPNow.remove_peer(Brk_mac);
                          memcpy(&Brk_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                          delay(300);
                          ESPNow.add_peer(Brk_mac);
                          //LogOutput::printf("[L]Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", Brk_mac[0], Brk_mac[1], Brk_mac[2], Brk_mac[3], Brk_mac[4],
                    Brk_mac[5]);

                        }
                        if(i==2)
                        {
                          ESPNow.remove_peer(Gas_mac);
                          memcpy(&Gas_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                          delay(300);
                          ESPNow.add_peer(Gas_mac);
                        }
                        if(i==3)
                        {
                          ESPNow.remove_peer(esp_Host);
                          memcpy(&esp_Host,&_ESP_pairing_reg.Pair_mac[i],6);
                          delay(300);
                          ESPNow.add_peer(esp_Host);
                        }
                      }
                    }
                    */
                }
            }
        }
#endif
        if (configUpdateAvailable) {
            if (dap_config_st.payLoadHeader_.PedalTag == 0) {
                if (dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0] == 1) {
                    ESPNow.send_message(Clu_mac, (uint8_t *)&dap_config_st, sizeof(dap_config_st));
                    LogOutput::printf("[L]Clutch config sent\n");
                    configUpdateAvailable = false;
                }
            }
            if (dap_config_st.payLoadHeader_.PedalTag == 1) {
                if (dap_bridge_state_st.payloadBridgeState_.Pedal_availability[1] == 1) {
                    ESPNow.send_message(Brk_mac, (uint8_t *)&dap_config_st, sizeof(dap_config_st));
                    LogOutput::printf("[L]BRK config sent\n");
                    configUpdateAvailable = false;
                }
            }
            if (dap_config_st.payLoadHeader_.PedalTag == 2) {
                if (dap_bridge_state_st.payloadBridgeState_.Pedal_availability[2] == 1) {
                    ESPNow.send_message(Gas_mac, (uint8_t *)&dap_config_st, sizeof(dap_config_st));
                    LogOutput::printf("[L]Throttle config sent\n");
                    configUpdateAvailable = false;
                }
            }
        }

        if (dap_action_update) {
            if (dap_actions_st.payLoadHeader_.PedalTag == 0 && dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0] == 1) {
                ESPNow.send_message(Clu_mac, (uint8_t *)&dap_actions_st, sizeof(dap_actions_st));
                // LogOutput::printf("BRK sent\n");
            }
            if (dap_actions_st.payLoadHeader_.PedalTag == 1 && dap_bridge_state_st.payloadBridgeState_.Pedal_availability[1] == 1) {
                ESPNow.send_message(Brk_mac, (uint8_t *)&dap_actions_st, sizeof(dap_actions_st));
                // LogOutput::printf("BRK sent\n");
            }

            if (dap_actions_st.payLoadHeader_.PedalTag == 2 && dap_bridge_state_st.payloadBridgeState_.Pedal_availability[2] == 1) {
                ESPNow.send_message(Gas_mac, (uint8_t *)&dap_actions_st, sizeof(dap_actions_st));
                // LogOutput::printf("GAS sent\n");
            }

            // ESPNow.send_message(broadcast_mac,(uint8_t *) &dap_actions_st,sizeof(dap_actions_st));
            // LogOutput::printf("Broadcast sent\n");
            dap_action_update = false;
        }
        // forward the basic wifi info for pedals
        if (pedal_OTA_action_b) {
            switch (_basic_wifi_info.device_ID) {
                case 0:
                    ESPNow.send_message(Clu_mac, (uint8_t *)&_basic_wifi_info, sizeof(Basic_WIfi_info));
                    LogOutput::printf("[L]Forward to Clutch\n");
                    break;
                case 1:
                    ESPNow.send_message(Brk_mac, (uint8_t *)&_basic_wifi_info, sizeof(Basic_WIfi_info));
                    LogOutput::printf("[L]Forward to Brake\n");
                    break;
                case 2:
                    ESPNow.send_message(Gas_mac, (uint8_t *)&_basic_wifi_info, sizeof(Basic_WIfi_info));
                    LogOutput::printf("[L]Forward to Throttle\n");
                    break;
            }
            pedal_OTA_action_b = false;
        }

        delay(2);
    }
}

void update_controller_output(void) {
    int32_t clutch_value = NormalizeControllerOutputValue(axes_manager.get_controller_value(0), 0.0, 1.0, 100.0);
    int32_t brake_value = NormalizeControllerOutputValue(axes_manager.get_controller_value(1), 0.0, 1.0, 100.0);
    int32_t throttle_value = NormalizeControllerOutputValue(axes_manager.get_controller_value(2), 0.0, 1.0, 100.0);
    if (IsControllerReady()) {
        if (pedal_status == 0) {
            SetControllerOutputValueClutch(clutch_value);
            SetControllerOutputValueBrake(brake_value);
            SetControllerOutputValueThrottle(throttle_value);
            SetControllerOutputValueRudder(0);
            SetControllerOutputValueRudder_brake(0, 0);
        }
        if (pedal_status == 1) {
            SetControllerOutputValueClutch(0);
            SetControllerOutputValueBrake(0);
            SetControllerOutputValueThrottle(0);
            SetControllerOutputValueRudder(throttle_value);
            SetControllerOutputValueRudder_brake(0, 0);
        }
        joystickSendState();
    }
}

