CK-AT/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
void Serial_Task(void *pvParameters) {
    for (;;) {
        unsigned long current_time = millis();

        uint16_t n = Serial.available();
        if (n) {
            char buffer[n];
            Serial.readBytes(buffer, n);
            if (on_data_reception((uint8_t *)buffer, n, CommChannel::USB_SERIAL) == false) {
#ifdef OTA_Update
                // not an FFB data type, might be Basic_WIfi_info
                if (n == sizeof(Basic_WIfi_info)) {
                    Serial.printf("[L]get basic wifi info\r\n");
                    memcpy((char *)&_basic_wifi_info, buffer, sizeof(Basic_WIfi_info));
                    if (_basic_wifi_info.device_ID == deviceID) {
                        SSID = new char[_basic_wifi_info.SSID_Length + 1];
                        PASS = new char[_basic_wifi_info.PASS_Length + 1];
                        memcpy(SSID, _basic_wifi_info.WIFI_SSID, _basic_wifi_info.SSID_Length);
                        memcpy(PASS, _basic_wifi_info.WIFI_PASS, _basic_wifi_info.PASS_Length);
                        SSID[_basic_wifi_info.SSID_Length] = 0;
                        PASS[_basic_wifi_info.PASS_Length] = 0;
                        OTA_enable_b = true;
                    } else {
                        pedal_OTA_action_b = true;
                    }
                } else
#endif
                {
                    Serial.printf("[L]%d bytes of unknown data reveived\r\n", n);
                }
            }
        }

        if ((current_time - bridge_state_last_update) > 100) {
            bridge_state_last_update = millis();
            int rssi_filter_value = -10;
            dap_bridge_state_st.payloadBridgeState_.Pedal_RSSI = (uint8_t)(rssi_filter_value + 101);
            dap_bridge_state_st.payLoadHeader_.PedalTag = 5;  // 5 means bridge
            dap_bridge_state_st.payLoadHeader_.payloadType = DAP_PAYLOAD_TYPE_BRIDGE_STATE;
            dap_bridge_state_st.payLoadHeader_.version = DAP_VERSION_CONFIG;
            dap_bridge_state_st.payloadBridgeState_.Bridge_action = 0;
            DAP_state_basic_st basic_state;
            for (uint8_t axis_id = 0; axis_id < 3; axis_id++) {
                if (can_manager.is_online(axis_id)) {
                    if (dap_bridge_state_st.payloadBridgeState_.Pedal_availability[axis_id] == 0) {
                        Serial.printf("[L]Axis %d (%s): connected\r\n", axis_id, axis_names[axis_id]);
                    }
                    dap_bridge_state_st.payloadBridgeState_.Pedal_availability[axis_id] = 1;
                } else {
                    if (dap_bridge_state_st.payloadBridgeState_.Pedal_availability[axis_id] == 1) {
                        Serial.printf("[L]Axis %d (%s); disconnected\r\n", axis_id, axis_names[axis_id]);
                    }
                    dap_bridge_state_st.payloadBridgeState_.Pedal_availability[axis_id] = 0;
                }
                axes_manager.populate_basic_state(axis_id, basic_state);
                Serial.write((char *)&basic_state, sizeof(DAP_state_basic_st));
                Serial.print("\r\n");
            }
            dap_bridge_state_st.payloadFooter_.checkSum = 0;
            update_crc(dap_bridge_state_st.payloadFooter_.checkSum, &dap_bridge_state_st,
                       sizeof(DAP_bridge_state_st::payLoadHeader_) + sizeof(DAP_bridge_state_st::payloadBridgeState_));
            Serial.write((char *)&dap_bridge_state_st, sizeof(DAP_bridge_state_st));
            Serial.print("\r\n");
        }

#if defined(USB_JOYSTICK) && ARDUINO_USB_CDC_ON_BOOT == 1
        delay(2);

        update_controller_output();

#endif

        logOutput.pump(5);
        debugOutput.pump(5);

        delay(2);
    }
}

#if defined(USB_JOYSTICK) && ARDUINO_USB_CDC_ON_BOOT == 0
void Joystick_Task(void *pvParameters) {
    for (;;) {
        update_controller_output();
        delay(2);
    }
}
#endif

// OTA multitask
uint16_t OTA_count = 0;
bool message_out_b = false;
bool OTA_enable_start = false;
uint32_t otaTask_stackSizeIdx_u32 = 0;
void OTATask(void *pvParameters) {
    for (;;) {
#ifdef OTA_Update
        if (OTA_count > 200) {
            message_out_b = true;
            OTA_count = 0;
        } else {
            OTA_count++;
        }

        if (OTA_enable_b) {
            if (message_out_b) {
                message_out_b = false;
                LogOutput::printf("[L]OTA enable flag on\n");
            }
            if (OTA_status) {
                // server.handleClient();
            } else {
                LogOutput::printf("[L]de-initialize espnow\n");
                LogOutput::printf("[L]wait...\n");
                esp_err_t result = esp_now_deinit();
                ESPNow_initial_status = false;
                ESPNOW_status = false;
                delay(200);
                if (result == ESP_OK) {
                    OTA_status = true;
                    delay(1000);
                    // ota_wifi_initialize(APhost);
                    wifi_initialized(SSID, PASS);
                    delay(2000);
                    ESP32OTAPull ota;
                    char *Version_tag;
                    int ret;
                    ota.SetCallback(OTAcallback);
                    ota.OverrideBoard(BRIDGE_BOARD);
                    Version_tag = BRIDGE_FIRMWARE_VERSION;
                    if (_basic_wifi_info.wifi_action == 1) {
                        Version_tag = "0.0.0";
                        LogOutput::printf("Force update\n");
                    }
                    switch (_basic_wifi_info.mode_select) {
                        case 1:
                            LogOutput::printf("[L]Flashing to latest Main, checking %s to see if an update is available...\n", JSON_URL_main);
                            ret = ota.CheckForOTAUpdate(JSON_URL_main, Version_tag);
                            LogOutput::printf("[L]CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                            break;
                        case 2:
                            LogOutput::printf("[L]Flashing to latest Dev, checking %s to see if an update is available...\n", JSON_URL_dev);
                            ret = ota.CheckForOTAUpdate(JSON_URL_dev, Version_tag);
                            LogOutput::printf("[L]CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                            break;
                        default:
                            break;
                    }

