CK-AT/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
                    delay(3000);
                }
            }
        }

        // delay(2);
#endif

#ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
        if (otaTask_stackSizeIdx_u32 == 1000) {
            UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
            LogOutput::printf("StackSize (OTA): %i\n", stackHighWaterMark);
            otaTask_stackSizeIdx_u32 = 0;
        }
        otaTask_stackSizeIdx_u32++;
#endif
        delay(2);
    }
}

// LED task
uint8_t LED_bright_index = 0;
uint8_t LED_bright_direction = 1;
void LED_Task(void *pvParameters) {
    for (;;) {
#ifdef LED_ENABLE_WAVESHARE
        // LED status update
        if (LED_Status == 0) {
            if (LED_bright_index > 30) {
                LED_bright_direction = -1;
            }
            if (LED_bright_index < 2) {
                LED_bright_direction = 1;
            }
            LED_bright_index = LED_bright_index + LED_bright_direction;
            pixels.setBrightness(LED_bright_index);
            uint8_t led_status = dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0] +
                                 dap_bridge_state_st.payloadBridgeState_.Pedal_availability[1] * 2 +
                                 dap_bridge_state_st.payloadBridgeState_.Pedal_availability[2] * 4;
            switch (led_status) {
                case 0:
                    pixels.setPixelColor(0, 0xff, 0xff, 0xff);
                    // pixels.setPixelColor(0,0x52,0x00,0xff);//Orange
                    pixels.show();
                    break;
                case 1:
                    pixels.setPixelColor(0, 0xff, 0x00, 0x00);  // Red
                    pixels.show();
                    break;
                case 2:
                    pixels.setPixelColor(0, 0xff, 0x0f, 0x00);  // Orange
                    pixels.show();
                    break;
                case 3:
                    pixels.setPixelColor(0, 0x52, 0x00, 0xff);  // Cyan
                    pixels.show();
                    break;
                case 4:
                    pixels.setPixelColor(0, 0x5f, 0x5f, 0x00);  // Yellow
                    pixels.show();
                    break;
                case 5:
                    pixels.setPixelColor(0, 0x00, 0x00, 0xff);  // Blue
                    pixels.show();
                    break;
                case 6:
                    pixels.setPixelColor(0, 0x00, 0xff, 0x00);  // Green
                    pixels.show();
                    break;
                case 7:
                    pixels.setPixelColor(0, 0x80, 0x00, 0x80);  // Purple
                    pixels.show();
                    break;
                default:
                    break;
            }
            delay(150);
        }
        if (LED_Status == 1)  // pairing
        {
            // delay(1000);
            pixels.setPixelColor(0, 0xff, 0x00, 0x00);  // Red
            pixels.setBrightness(25);
            pixels.show();
            delay(500);
            pixels.setPixelColor(0, 0x00, 0x00, 0x00);  // fill no color
            // pixels.setBrightness(0);
            pixels.show();
            delay(500);
        }

#endif
        delay(10);
    }
}

void LED_Task_Dongle(void *pvParameters) {
    for (;;) {
#ifdef LED_ENABLE_DONGLE
        // LED status update
        if (LED_Status == 0) {
            if (LED_bright_index > 30) {
                LED_bright_direction = -1;
            }
            if (LED_bright_index < 2) {
                LED_bright_direction = 1;
            }
            LED_bright_index = LED_bright_index + LED_bright_direction;
            pixels.setBrightness(LED_bright_index);

            for (uint i = 0; i < 3; i++) {
                if (dap_bridge_state_st.payloadBridgeState_.Pedal_availability[i] == 1) {
                    pixels.setPixelColor(i, 0xff, 0x0f, 0x00);  // Orange
                } else {
                    pixels.setPixelColor(i, 0xff, 0xff, 0xff);  // White
                }
            }
            pixels.show();

            delay(150);
        }
        if (LED_Status == 1)  // pairing
        {
            // delay(1000);
            for (uint i = 0; i < 3; i++) {
                pixels.setPixelColor(i, 0xff, 0x00, 0x00);  // Red
            }

            pixels.setBrightness(25);
            pixels.show();
            delay(500);
            for (uint i = 0; i < 3; i++) {
                pixels.setPixelColor(i, 0x00, 0x00, 0x00);  // fill no color
            }

            // pixels.setBrightness(0);
            pixels.show();
            delay(500);
        }

#endif
        delay(10);
    }
}

void FanatecUpdate(void *pvParameters) {
    for (;;) {
#ifdef Fanatec_comunication
        fanatec.communicationUpdate();
        if (fanatec.isPlugged()) {
            uint16_t throttleValue = pedal_throttle_value;
            uint16_t brakeValue = pedal_brake_value;
            uint16_t clutchValue = pedal_cluth_value;
            uint16_t handbrakeValue = 0;  // Set if needed

            // Pedal input values to 0 - 10000
            throttleValue = map(throttleValue, 0, 10000, 0, 65535);
            brakeValue = map(brakeValue, 0, 10000, 0, 22000);
            clutchValue = map(clutchValue, 0, 10000, 0, 65535);

            // Set pedal values in FanatecInterface
            fanatec.setThrottle(throttleValue);
            fanatec.setBrake(brakeValue);
            fanatec.setClutch(clutchValue);
            fanatec.setHandbrake(handbrakeValue);

            fanatec.update();
        }
#endif
        delay(10);
    }
}

/**********************************************************************************************/
/*                                                                                            */
/*                         pedal update task                                                  */
/*                                                                                            */
/**********************************************************************************************/

// long lastCallTime = micros();
unsigned long cycleTimeLastCall = micros();
unsigned long minCyclesForFirToInit = 1000;
unsigned long firCycleIncrementer = 0;

float filteredReading_exp_filter = 0;
unsigned long printCycleCounter = 0;

/**********************************************************************************************/
/*                                                                                            */
/*                         communication task                                                 */
/*                                                                                            */
/**********************************************************************************************/
